InformationRegisters/упНесовместимыеВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упНесовместимыеВидыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упНесовместимыеВидыНоменклатуры/Ext/RecordSetModule.bsl
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Не ОбменДанными.Загрузка Тогда
		ТаблицаНабора = ЭтотОбъект.Выгрузить();
		
		// очищаем зеркала старых строк
		ЭтотОбъект.Прочитать();
		Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
			ЗеркальныйНаборЗаписей = РегистрыСведений.упНесовместимыеВидыНоменклатуры.СоздатьНаборЗаписей();
			ЗеркальныйНаборЗаписей.Отбор.ВидНоменклатуры1.Установить(СтрокаНабора.ВидНоменклатуры2);
			ЗеркальныйНаборЗаписей.Отбор.ВидНоменклатуры2.Установить(СтрокаНабора.ВидНоменклатуры1);
			ЗеркальныйНаборЗаписей.Отбор.Партнер.Установить(СтрокаНабора.Партнер);
			ЗеркальныйНаборЗаписей.ОбменДанными.Загрузка = Истина;
			ЗеркальныйНаборЗаписей.Записать();
		КонецЦикла;
		
		// добавляем зеркала новых строк
		ЭтотОбъект.Загрузить(ТаблицаНабора);
		Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
			ЗеркальныйНаборЗаписей = РегистрыСведений.упНесовместимыеВидыНоменклатуры.СоздатьНаборЗаписей();
			ЗеркальныйНаборЗаписей.Отбор.ВидНоменклатуры1.Установить(СтрокаНабора.ВидНоменклатуры2);
			ЗеркальныйНаборЗаписей.Отбор.ВидНоменклатуры2.Установить(СтрокаНабора.ВидНоменклатуры1);
			ЗеркальныйНаборЗаписей.Отбор.Партнер.Установить(СтрокаНабора.Партнер);
			ЗеркальнаяСтрока = ЗеркальныйНаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗеркальнаяСтрока, СтрокаНабора); 
			ЗеркальнаяСтрока.ВидНоменклатуры1 = СтрокаНабора.ВидНоменклатуры2;
			ЗеркальнаяСтрока.ВидНоменклатуры2 = СтрокаНабора.ВидНоменклатуры1;
			ЗеркальнаяСтрока.Партнер = СтрокаНабора.Партнер;
			ЗеркальныйНаборЗаписей.ОбменДанными.Загрузка = Истина;
			ЗеркальныйНаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли; 
	

КонецПроцедуры
#КонецОбласти
